//JCLB001  JOB ,'DAVID',CLASS=A,REGION=0M,
//         MSGLEVEL=(1,1),MSGCLASS=P
//*
//* HELLO WORLD!
//S01PB001 EXEC PGM=APPB001,COND=(0,NE)
//STEPLIB  DD DSN=D.LIB.LOAD.BATCH,DISP=SHR
//SYSOUT   DD SYSOUT=*
//*